{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6d034202-3bde-4d6c-8402-4196fe34d59a",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "# Search for properties related to a keyword on the Wikidata SPARQL endpoint\n",
    "# Used to manually determine which Wikidata property best matches our custom predicate\n",
    "def search_wikidata_property(keyword):\n",
    "    url = \"https://query.wikidata.org/sparql\"\n",
    "    query = f\"\"\"\n",
    "    SELECT ?property ?propertyLabel WHERE {{\n",
    "        ?property a wikibase:Property .\n",
    "        ?property rdfs:label ?propertyLabel .\n",
    "        FILTER(CONTAINS(LCASE(?propertyLabel), \"{keyword}\"))\n",
    "        FILTER(LANG(?propertyLabel) = \"en\")\n",
    "    }}\n",
    "    LIMIT 10\n",
    "    \"\"\"\n",
    "    headers = {\n",
    "        \"User-Agent\": \"MovieKG-StudentProject/1.0 (han.wang@edu.devinci.fr)\",\n",
    "        \"Accept\": \"application/json\"\n",
    "    }\n",
    "    r = requests.get(url, params={\"query\": query, \"format\": \"json\"}, headers=headers, timeout=15)\n",
    "    results = r.json()[\"results\"][\"bindings\"]\n",
    "    for row in results:\n",
    "        print(row[\"property\"][\"value\"], \"|\", row[\"propertyLabel\"][\"value\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2d0d7bb0-5787-47a6-ab5b-550d4f08c457",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Searching Wikidata properties...\n",
      "\n",
      "--- director ---\n",
      "http://www.wikidata.org/entity/P633 | Quebec cultural heritage directory ID\n",
      "http://www.wikidata.org/entity/P57 | director\n",
      "http://www.wikidata.org/entity/P344 | director of photography\n",
      "http://www.wikidata.org/entity/P4227 | Indonesian Small Islands Directory ID\n",
      "http://www.wikidata.org/entity/P4283 | LUMIERE director ID\n",
      "http://www.wikidata.org/entity/P3174 | art director\n",
      "http://www.wikidata.org/entity/P5115 | Directory of Open Access Journals ID\n",
      "http://www.wikidata.org/entity/P4345 | director of archaeological fieldwork\n",
      "http://www.wikidata.org/entity/P5126 | assistant director\n",
      "http://www.wikidata.org/entity/P1037 | director / manager\n",
      "\n",
      "--- cast member ---\n",
      "http://www.wikidata.org/entity/P161 | cast member\n",
      "\n",
      "--- genre ---\n",
      "http://www.wikidata.org/entity/P136 | genre\n",
      "http://www.wikidata.org/entity/P4953 | Library of Congress Genre/Form Terms ID\n",
      "http://www.wikidata.org/entity/P6352 | OLAC video game genre vocabulary ID\n",
      "http://www.wikidata.org/entity/P7326 | MobyGames genre ID\n",
      "http://www.wikidata.org/entity/P6537 | Yandex Music genre ID\n",
      "http://www.wikidata.org/entity/P7616 | Lutris genre ID\n",
      "http://www.wikidata.org/entity/P8052 | MusicBrainz genre ID\n",
      "http://www.wikidata.org/entity/P9648 | Newspaper Genre List ID\n",
      "http://www.wikidata.org/entity/P10438 | Norwegian thesaurus on genre and form ID\n",
      "http://www.wikidata.org/entity/P9173 | Rate Your Music genre ID\n",
      "\n",
      "--- production company ---\n",
      "http://www.wikidata.org/entity/P272 | production company\n",
      "http://www.wikidata.org/entity/P12841 | Cineuropa production company ID\n",
      "\n",
      "--- publication date ---\n",
      "http://www.wikidata.org/entity/P577 | publication date\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Search by keyword and manually determine the most appropriate match\n",
    "print(\"Searching Wikidata properties...\\n\")\n",
    "for keyword in [\"director\", \"cast member\", \"genre\", \"production company\", \"publication date\"]:\n",
    "    print(f\"--- {keyword} ---\")\n",
    "    search_wikidata_property(keyword)\n",
    "    print()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d0b7ff49-4e6f-407c-9fc0-f2fc239a7192",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N905faeaddbcd44f3a0576988f98243ae (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from rdflib import Graph, Namespace, URIRef, OWL, RDFS\n",
    "\n",
    "MVO = Namespace(\"http://moviekg.local/ontology/\")\n",
    "WDT = Namespace(\"http://www.wikidata.org/prop/direct/\")\n",
    "\n",
    "pred_g = Graph()\n",
    "pred_g.bind(\"mvo\", MVO)\n",
    "pred_g.bind(\"wdt\", WDT)\n",
    "pred_g.bind(\"owl\", OWL)\n",
    "\n",
    "# Based on the results of the SPARQL query, manually select the most relevant Wikidata property:\n",
    "alignments = [\n",
    "    (\"hasDirector\", \"P57\"),\n",
    "    (\"hasActor\",    \"P161\"),\n",
    "    (\"hasGenre\",    \"P136\"),\n",
    "    (\"producedBy\",  \"P272\"),\n",
    "    (\"releaseYear\", \"P577\"),\n",
    "]\n",
    "\n",
    "# owl:equivalentProperty indicates that two properties are semantically equivalent\n",
    "for local_prop, wikidata_prop in alignments:\n",
    "    pred_g.add((\n",
    "        MVO[local_prop],\n",
    "        OWL.equivalentProperty,\n",
    "        WDT[wikidata_prop]\n",
    "    ))\n",
    "\n",
    "# hasTitle has no equivalent property, marked as subPropertyOf rdfs:label\n",
    "pred_g.add((\n",
    "    MVO.hasTitle,\n",
    "    RDFS.subPropertyOf,\n",
    "    RDFS.label\n",
    "))\n",
    "\n",
    "pred_g.serialize(\"predicate_alignment.ttl\", format=\"turtle\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c8af43e8-01ca-4ea3-ba19-94e955cfecd5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
